
'''
    프로그래머스 2 x n 타일링
    총 길이에 따른 타일 배치 방법 경우의 수를 계산하는 문제
'''

def solution(n):

    '''
        나의 풀이

        나의 접근법
        옛날에 백준에서 풀어봐서 dp 문제라는 걸 알아서
        해보니 피보나치 문제 였음 ㅋㅋㅋ

        근데 처음엔 시간초과 뜨길래 뭐지 싶었는데
        n이 커질 수록 숫자도 엄~~~청 커져서 더하는데도 시간이 많이 걸리는 것 같았음
        어차피 반환해야하는 값도 10억7로 나눈 나머지 이기 때문에
        수 만들면서 % 연산해주니 풀렸음 ㅎㅎ

        근데 하면서 신기한점은
        나눈 나머지를 계속 더해가면서 하는 거랑
        원래 값을 계속 더해가면서 마지막에 % 해준거랑 결과값이 같은게 신기함 ㅋㅋㅋ

        당연한건가?? ㅋㅋㅋㅋ
    '''

    dp = [0] * (n + 1)

    if n == 1:
        return 1 % 1_000_000_007

    dp[1] = 1
    dp[2] = 2

    for i in range(3, n+1):
        dp[i] = (dp[i-1] + dp[i-2]) % 1_000_000_007


    return dp[-1]

print(solution(9999))